-- Task 1
SELECT Н_ЛЮДИ.ИМЯ, Н_ВЕДОМОСТИ.ДАТА
FROM Н_ЛЮДИ
LEFT OUTER JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ИМЯ > 'Николай'
AND Н_ВЕДОМОСТИ.ИД < 1250972
AND Н_ВЕДОМОСТИ.ИД = 1250981;

-- Task 2
SELECT Н_ЛЮДИ.ИМЯ, Н_ОБУЧЕНИЯ.ЧЛВК_ИД, Н_УЧЕНИКИ.ГРУППА
FROM Н_ЛЮДИ
INNER JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
INNER JOIN Н_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ИМЯ = 'Александр'
AND Н_ОБУЧЕНИЯ.НЗК > '001000';

-- Task 3
SELECT COUNT(Н_ЛЮДИ.ИМЯ)
FROM Н_ЛЮДИ
INNER JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
INNER JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
INNER JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.ИМЯ_В_ИМИН_ПАДЕЖЕ='вечерняя'
AND AGE(NOW(), Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ) < INTERVAL '20 years';

-- Task 4
SELECT Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
FROM Н_ГРУППЫ_ПЛАНОВ
INNER JOIN Н_ПЛАНЫ ON Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
INNER JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
WHERE Н_ОТДЕЛЫ.ИМЯ_В_ИМИН_ПАДЕЖЕ='кафедра вычислительной техники'
GROUP BY Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
HAVING COUNT(Н_ГРУППЫ_ПЛАНОВ.ГРУППА) = 2;

-- Task 5
WITH AverageScore3100 AS (
    SELECT
        AVG(ОЦЕНКА::DECIMAL) FILTER (WHERE ОЦЕНКА ~ '^[1-5]$') AS AVG_3100
    FROM Н_ВЕДОМОСТИ
    INNER JOIN Н_ЛЮДИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    INNER JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
    INNER JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    WHERE Н_УЧЕНИКИ.ГРУППА = ‘3100’)
SELECT
    Н_УЧЕНИКИ.ГРУППА,
    AVG(ОЦЕНКА::DECIMAL) FILTER (WHERE ОЦЕНКА ~ '^[1-5]$') AS GroupAverage
FROM Н_ВЕДОМОСТИ
INNER JOIN Н_ЛЮДИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
INNER JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
INNER JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
GROUP BY Н_УЧЕНИКИ.ГРУППА
HAVING AVG(ОЦЕНКА::DECIMAL) FILTER (WHERE ОЦЕНКА ~ '^[1-5]$') < (SELECT AVG_3100 FROM AverageScore3100)
ORDER BY (Н_УЧЕНИКИ.ГРУППА::INT);

-- Task 6
SELECT 
    ГРУППА,
    Н_УЧЕНИКИ.ИД,
    ФАМИЛИЯ,
    ИМЯ,
    ОТЧЕСТВО,
    П_ПРКОК_ИД
FROM 
    Н_ЛЮДИ
INNER JOIN 
    Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
INNER JOIN 
    Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
INNER JOIN 
    Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
WHERE 
    (НАИМЕНОВАНИЕ='заочная' OR НАИМЕНОВАНИЕ='очная')
AND 
    EXISTS (	
        SELECT * 
        FROM Н_УЧЕНИКИ
        WHERE ПРИЗНАК='отчисл'
        AND СОСТОЯНИЕ='утвержден'
        AND ИД=Н_УЧЕНИКИ.ИД
        AND DATE(КОНЕЦ)<'2012-09-01'
    );
-- Task 7
SELECT COUNT(*)
FROM (
	SELECT Н_УЧЕНИКИ.ЧЛВК_ИД
	FROM Н_ВЕДОМОСТИ
INNER JOIN Н_ЛЮДИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
INNER JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
INNER JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
	    GROUP BY Н_УЧЕНИКИ.ЧЛВК_ИД
	    HAVING AVG(ОЦЕНКА::DECIMAL) FILTER (WHERE ОЦЕНКА ~ '^[1-5]$') = 5.0
	) as ОТЛИЧНИКИ;
